LoadTesting/scripts/getAnnotationsForUserBook_All_250.txt
Running 5m test
  2 threads and 10 connections
  Thread calibration: mean lat.: 4.025ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 5.588ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    21.65ms   88.44ms   1.00s    95.13%
    Req/Sec   132.20    152.77     2.67k    93.46%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.87ms
 75.000%    3.49ms
 90.000%    6.36ms
 99.000%  523.78ms
 99.900%  856.58ms
 99.990%  989.18ms
 99.999%  999.93ms
100.000%    1.00s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.391     0.000000            1         1.00
       2.091     0.100000         7265         1.11
       2.335     0.200000        14505         1.25
       2.529     0.300000        21715         1.43
       2.697     0.400000        29041         1.67
       2.869     0.500000        36259         2.00
       2.959     0.550000        39801         2.22
       3.063     0.600000        43449         2.50
       3.177     0.650000        47077         2.86
       3.317     0.700000        50679         3.33
       3.487     0.750000        54282         4.00
       3.591     0.775000        56097         4.44
       3.731     0.800000        57905         5.00
       3.917     0.825000        59697         5.71
       4.243     0.850000        61522         6.67
       4.867     0.875000        63316         8.00
       5.423     0.887500        64224         8.89
       6.359     0.900000        65126        10.00
       8.131     0.912500        66030        11.43
      14.047     0.925000        66933        13.33
      45.183     0.937500        67838        16.00
      71.167     0.943750        68290        17.78
     103.231     0.950000        68742        20.00
     142.079     0.956250        69198        22.86
     187.391     0.962500        69647        26.67
     241.151     0.968750        70101        32.00
     269.311     0.971875        70325        35.56
     300.287     0.975000        70552        40.00
     336.127     0.978125        70780        45.71
     374.783     0.981250        71005        53.33
     419.327     0.984375        71231        64.00
     445.695     0.985938        71343        71.11
     472.319     0.987500        71456        80.00
     503.807     0.989062        71570        91.43
     537.599     0.990625        71683       106.67
     571.903     0.992188        71797       128.00
     591.359     0.992969        71852       142.22
     613.375     0.993750        71908       160.00
     637.439     0.994531        71966       182.86
     664.575     0.995313        72021       213.33
     696.831     0.996094        72078       256.00
     710.143     0.996484        72106       284.44
     730.623     0.996875        72134       320.00
     746.495     0.997266        72163       365.71
     770.047     0.997656        72191       426.67
     787.967     0.998047        72219       512.00
     808.959     0.998242        72233       568.89
     818.175     0.998437        72247       640.00
     827.391     0.998633        72262       731.43
     846.847     0.998828        72276       853.33
     858.111     0.999023        72290      1024.00
     862.207     0.999121        72298      1137.78
     879.615     0.999219        72304      1280.00
     888.319     0.999316        72311      1462.86
     894.975     0.999414        72318      1706.67
     916.479     0.999512        72325      2048.00
     921.599     0.999561        72329      2275.56
     925.695     0.999609        72332      2560.00
     930.303     0.999658        72336      2925.71
     935.935     0.999707        72339      3413.33
     952.831     0.999756        72343      4096.00
     958.975     0.999780        72346      4551.11
     958.975     0.999805        72346      5120.00
     963.583     0.999829        72348      5851.43
     967.679     0.999854        72350      6826.67
     985.599     0.999878        72352      8192.00
     989.183     0.999890        72353      9102.22
     989.183     0.999902        72353     10240.00
     990.207     0.999915        72354     11702.86
     994.815     0.999927        72355     13653.33
     995.327     0.999939        72356     16384.00
     999.423     0.999945        72358     18204.44
     999.423     0.999951        72358     20480.00
     999.423     0.999957        72358     23405.71
     999.423     0.999963        72358     27306.67
     999.423     0.999969        72358     32768.00
     999.935     0.999973        72359     36408.89
     999.935     0.999976        72359     40960.00
     999.935     0.999979        72359     46811.43
     999.935     0.999982        72359     54613.33
     999.935     0.999985        72359     65536.00
    1004.031     0.999986        72360     72817.78
    1004.031     1.000000        72360          inf
#[Mean    =       21.650, StdDeviation   =       88.444]
#[Max     =     1003.520, Total count    =        72360]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  74872 requests in 4.99m, 11.42MB read
Requests/sec:    250.14
Transfer/sec:     39.08KB