LoadTesting/scripts/getAnnotationsForUserBook_All_250.txt
Running 5m test
  2 threads and 10 connections
  Thread calibration: mean lat.: 3.025ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.936ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    56.49ms  316.62ms   4.83s    96.24%
    Req/Sec   131.61    136.67     2.67k    95.40%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.91ms
 75.000%    3.55ms
 90.000%    6.36ms
 99.000%    1.59s 
 99.900%    4.21s 
 99.990%    4.70s 
 99.999%    4.79s 
100.000%    4.83s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.497     0.000000            1         1.00
       2.179     0.100000         7264         1.11
       2.389     0.200000        14493         1.25
       2.571     0.300000        21750         1.43
       2.743     0.400000        29008         1.67
       2.907     0.500000        36232         2.00
       2.995     0.550000        39855         2.22
       3.099     0.600000        43498         2.50
       3.213     0.650000        47047         2.86
       3.361     0.700000        50665         3.33
       3.551     0.750000        54309         4.00
       3.683     0.775000        56100         4.44
       3.853     0.800000        57908         5.00
       4.119     0.825000        59716         5.71
       4.563     0.850000        61521         6.67
       5.271     0.875000        63338         8.00
       5.735     0.887500        64235         8.89
       6.355     0.900000        65140        10.00
       7.319     0.912500        66047        11.43
       8.967     0.925000        66949        13.33
      15.679     0.937500        67854        16.00
      62.559     0.943750        68306        17.78
     142.975     0.950000        68759        20.00
     250.239     0.956250        69213        22.86
     374.783     0.962500        69664        26.67
     525.823     0.968750        70116        32.00
     607.231     0.971875        70344        35.56
     698.879     0.975000        70569        40.00
     825.855     0.978125        70797        45.71
     961.535     0.981250        71020        53.33
    1121.279     0.984375        71251        64.00
    1209.343     0.985938        71361        71.11
    1342.463     0.987500        71475        80.00
    1478.655     0.989062        71588        91.43
    1680.383     0.990625        71700       106.67
    1896.447     0.992188        71813       128.00
    2044.927     0.992969        71869       142.22
    2181.119     0.993750        71925       160.00
    2326.527     0.994531        71983       182.86
    2459.647     0.995313        72038       213.33
    2621.439     0.996094        72095       256.00
    2844.671     0.996484        72123       284.44
    3039.231     0.996875        72151       320.00
    3260.415     0.997266        72180       365.71
    3479.551     0.997656        72209       426.67
    3682.303     0.998047        72236       512.00
    3786.751     0.998242        72250       568.89
    3899.391     0.998437        72264       640.00
    4014.079     0.998633        72279       731.43
    4126.719     0.998828        72294       853.33
    4218.879     0.999023        72307      1024.00
    4276.223     0.999121        72314      1137.78
    4329.471     0.999219        72321      1280.00
    4386.815     0.999316        72329      1462.86
    4435.967     0.999414        72336      1706.67
    4485.119     0.999512        72342      2048.00
    4513.791     0.999561        72346      2275.56
    4538.367     0.999609        72349      2560.00
    4575.231     0.999658        72354      2925.71
    4591.615     0.999707        72356      3413.33
    4624.383     0.999756        72360      4096.00
    4628.479     0.999780        72362      4551.11
    4640.767     0.999805        72363      5120.00
    4657.151     0.999829        72365      5851.43
    4665.343     0.999854        72367      6826.67
    4689.919     0.999878        72369      8192.00
    4698.111     0.999890        72370      9102.22
    4698.111     0.999902        72370     10240.00
    4702.207     0.999915        72371     11702.86
    4714.495     0.999927        72372     13653.33
    4734.975     0.999939        72373     16384.00
    4755.455     0.999945        72374     18204.44
    4755.455     0.999951        72374     20480.00
    4755.455     0.999957        72374     23405.71
    4771.839     0.999963        72375     27306.67
    4771.839     0.999969        72375     32768.00
    4792.319     0.999973        72376     36408.89
    4792.319     0.999976        72376     40960.00
    4792.319     0.999979        72376     46811.43
    4792.319     0.999982        72376     54613.33
    4792.319     0.999985        72376     65536.00
    4829.183     0.999986        72377     72817.78
    4829.183     1.000000        72377          inf
#[Mean    =       56.494, StdDeviation   =      316.622]
#[Max     =     4825.088, Total count    =        72377]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  74889 requests in 4.99m, 11.43MB read
  Socket errors: connect 0, read 0, write 0, timeout 5
Requests/sec:    250.12
Transfer/sec:     39.08KB